{
  "apply": "Apply now",
  "productDesigner": {
    "name": "Product Designer",
    "location": "Shanghai/Chengdu",
    "class": "Design",
    "type": "Full Time",
    "jdContent": "<div class=\"part\"><h4>Job responsibilities :</h4><ul><li>Cooperate with the product manager and independently establish or cooperate with other designers to complete the interface design of the product.</li><li>Participate in designing company's product interaction standards and specifications.</li><li>According to the business needs and, output an interactive solution that is easy to use, and promotes the implementation of the solution.</li><li>Organize the usability test of the company's products, output test reports and suggest optimization opinions.</li></ul></div><div class=\"part\"><h>Job Requirements:</h4><ul><li>3-5 years of related work experience, Bachelor or above degree in psychology, computer science or related majors,  Good teamwork spirit and communication skills, can effectively communicate and cooperate with product managers and other designers. Successful design case examples, provide high-quality prototypes, flow charts, and wire-frame diagrams to clearly represent the designer's plan. Can quickly learn and understand business knowledge, have a strong logical thinking ability, can transform business logic and data performance into user-friendly interface design.</li><li>Familiar with various types of rapid interactive prototype tools including but not limited to: Axure RP, Sketch App, Invision App, Frame.js, React Sketch App etc.</li><li>Understand user centered design flow and problem solving capabilities to understand how web and mobile applications work, especially with browser-based interactive presentation technologies.  Good work ethics.</li><li>Understand database Entity-Relation data model concepts. Understand how digital currency works.</li></ul></div><div class=\"part\"><h4>Bonus</h4><ul><li>Experience with visual design, experience in web page refactoring and information architecture design is preferred. Knowledge of solidity, web3.js and other blockchain technology is preferred. Responsible for user experience design of enterprise-level products or large and medium-sized internet products, design experience of data visualization , crypto currency and security products is preferred. With a prioritized technical background or product background, it is a priority to be able to understand product logic and technical scenarios.</li></ul></div>"
  },
  "frontEndEngineer": {
    "name": "Front-End Develope",
    "location": "Shanghai/Chengdu",
    "class": "R&D",
    "type": "Full time",
    "jdContent": "<div class=\"part\"><h4>Attractive Qualities:</h4><p>Technology-driven, product-oriented, geek culture</p></div><div class=\"part\"><h4>Job responsibilities:</h4><ul><li>Participate in the design, development, and implementation of web front-end functionality in company projects, using open source libraries and tools such as React, Redux, and Next.js</li><li>Develop PC/Mobile-side applications using state-of-the-art web technologies such as HTML5, CSS3, TypeScript, React, etc. Working closely with team members to deliver products on schedule</li><li>Collaborate with product designers, back-end developers, to deliver high-quality Web front-end projects</li><li>Communicate closely with users, collect feedback/rules, and be able to quickly iterate products</li></ul></div><div class=\"part\"><h4>Job Requirements</h4><ul><li>Familiar with HTML5/CSS3 standards and in-depth understanding of cross-browser and platform compatibility issues</li><li>Proficient in object-oriented JavaScript, jQuery, DOM manipulation</li><li>Ability to implement HTML, CSS, JavaScript development according to product model or framework</li><li>Be able to pick up new front-end frameworks quickly</li><li>Understand Web standards and familiar with GitHub</li><li>Bachelor degree or above in related majors, or having equivalent professional experience</li><li>Proficient English communication skills</li><li>Fast learning and adaptive capabilities towards the startup team atmosphere</li></ul></div><div class=\"part\"><h4>Bonus</h4><ul><li>Excellent design sense</li><li>In-depth understanding of UI/UX</li><li>Familiar with how to optimize front-end code to make it more efficient and ensure compatibility</li><li>Familiar with React tech stack</li><li>Familiar with GraphQL technical specifications</li><li>Understand how digital cryptocurrency works</li><li>Learn about solidity, web3.js and other blockchain technologies</li><li>Familiar with any one or more backend language (Node.js/Ruby/Python/PHP, etc.)</li><li>Experience with mobile app development</li><li>Experience with React Native or Weex development</li><li>Experience with Android or iOS Native development </li><li>Proficient in solving major browsers and compatibility issues with different versions (IE Chrome Firefox etc.)</li></ul></div>"
  },
  "nodeJSEngineer": {
    "name": "Node.js Developer",
    "location": "Shanghai/Chengdu",
    "class": "R&D",
    "type": "Full time",
    "jdContent": "<div class=\"part\"><h4>Attractive Qualities:</h4><p>Technology-driven, product-oriented, geek culture</p></div><div class=\"part\"><h4>Job responsibility</h4><ul><li>Responsible for the development, testing and maintenance of product backend modules</li><li>Participate in the refactoring and optimization of the back-end code</li><li>Communicate closely with users, collect feedback, and achieve rapid iteration of product features</li><li>Close communication and cooperation with other team members to complete the project</li></ul></div><div class=\"part\"><h4>Job Requirements</h4><ul><li>Familiar with the development of Node.js, clearly understand the basic concepts of JavaScript , familiar with closure, callback, promise, Async / Await, etc.</li><li>Familiar with common frameworks such as Express / Koa, have a certain understanding of MVC, or have their own set of application development concepts</li><li>Master Git version control tools</li><li>Learn about common design patterns and programming best practices</li><li>Understand Web related standards and best practices</li><li>Solid foundation in computer science, familiar with operating systems, databases, data structures and algorithms, and software design practices</li><li>Familiar with Linux / Unix operating system</li><li>Be able to work in English environment</li><li>Quick learner and adapt to startup team working atmosphere</li></ul></div><div class=\"part\"><h4>Bonus</h4><ul><li>In addition to Node.js, able to code in other languages, such as Python, Go, Ruby, Elixir, Rust, Scala, Clojure, etc.</li><li>Pursue to the elegance of (products, code, designs)</li><li>Contributed to GitHub backend projects which have more than 100 stars, or contributed code to more than one large open source project</li><li>Having TDD/BDD practical experience in designing open API interfaces</li><li>Familiar with GraphQL technical specifications</li><li>Understand how digital cryptocurrency works</li><li>Knowledge about solidity, web3.js and other blockchain technologies</li></ul></div>"
  },
  "devOpsEngineer": {
    "name": "DevOp Engineer",
    "location": "Shanghai/Chengdu",
    "class": "R&D",
    "type": "Full time",
    "jdContent": "<div class=\"part\"><h4>Attractive Qualities:</h4><p>Technology-driven, product-oriented, geek culture</p></div><div class=\"part\"><h4>Job responsibility</h4><ul><li>Responsible for the setup and maintenance of production systems and computing infrastructure</li><li>Responsible for the monitoring, and troubleshooting of the production system and computing infrastructure</li><li>Responsible for designing, implementing and optimizing of the container platform</li><li>Responsible for designing, implementing, and optimizing product s’ deployment workflows</li><li>Close communication and cooperation with other technical team members to complete the project</li></ul></div><div class=\"part\"><h4>Job Requirements</h4><ul><li>Familiar with Linux / Unix operating system</li><li>Master a general purpose programming language under Linux/Unix environment</li><li>Master Git version control tools</li><li>Understand container related technologies</li><li>Understand the knowledge of security system operation and maintenance</li><li>Experience in using mainstream cloud platforms such as Alibaba Cloud / AWS / Google Cloud</li><li>Experience in using DevOp tools such as Terraform / Ansible / Chef / Puppet</li><li>Solid foundation of computer science, including operating system, computer network, and database</li><li>Be able to work in English environment</li><li>uick learner and adapt to startup team working atmosphere</li></ul></div><div class=\"part\"><h4>Bonus</h4><ul><li>Mastering the Go programming language</li><li>Have a certain amount of Cloud Computing working experience</li><li>Having practical experience in security system operation</li><li>Familiar with Docker technology and its ecosystem</li><li>Have a certain amount of container platform setup and maintenance experience</li><li>Skilled usage of Terraform platform</li><li>Designed and implemented open source DevOps tools, or contributed code to large open source projects</li><li>Excellent coding and designing capabilities</li><li>Understand the principle of crypto currency</li></ul></div>"
  },
  "graphicDesigner": {
    "name": "Graphic Designer",
    "location": "Shanghai/Chengdu",
    "class": "Design",
    "type": "Full time",
    "jdContent": "<div class=\"part\"><h4>Job Profile</h4><p>We are looking for a designer who can help us completely disrupt the blockchian industry by design attitude and technical methodology!</p></div><div class=\"part\"><h4>Your Duties</h4><ul><li>Design and iterate based on team results, product direction and feedback output</li><li>Improve and protect the company's brand design language</li><li>Turn the company's business goals into creative solutions</li><li>Create new design ideas and concepts with creative and conceptual thinking</li><li>Participate in brainstorming and sketching work of product design, and participate in visual design optimization of all projects</li><li>Helping each design project develop artistic directions, including the formulation of mood-boards, retouching notes, etc. to provide creative support for the company's daily design needs of all sizes</li><li>Help other internal teams (including but not limited to products, markets, public, content, customer support, and operations) assist in the creation of design assets including the production of printed documents and their quality control</li></ul></div><div class=\"part\"><h4>Who Are You</h4><ul><li>A brilliant creative thinker backed by a strong portfolio</li><li>Have an educational background in visual communication or graphic design (or a related major, bachelor’s or master’s degree is best) Outstanding concept designers have a good sense of composition</li><li>At the same time, have rich digital (screen) and print media design experience</li><li>Excellent communication and organization skills</li><li>Skilled use of tools such as Adobe CC, Affinity, and Sketch App</li><li>Passion for branding systems and storytelling</li><li>Keen to design innovations of all types and sizes</li><li>Ability to complete work independently and demonstrate excellent time management capabilities in project cooperation</li><li>Ability to participate in multiple projects at the same time</li><li>Identify the importance of sense of humor, emotion management and empathy in project cooperation</li><li>Open minded, willing to propose and accept peer suggestions</li><li>It's okay to have a little quirk = =</li></ul></div>"
  },
  "pleaseSend": "Please send your CV to"
}